ReneLuedecke/stm32-helium-demo/Projects/NUCLEO-N657X0-Q/Examples/CORTEX/CORTEX_HELIUM/FSBL/Src/main.c
    const uint32x4_t rnd = vdupq_n_u32(1u << (shift - 1));
    const int32x4_t off32 = vdupq_n_s32(offset);
    const int32x4_t zeroS = vdupq_n_s32(0);
    const int32x4_t negSh = vdupq_n_s32(-15);

    for (; i <= n - step; i += step)
    {
        uint16x8_t s16 = vld1q_u16(src + i);
        uint16x8_t g16 = vld1q_u16(gain + i);

        uint32x4_t lo32 = vmullbq_int_u16(s16, g16);
        uint32x4_t hi32 = vmulltq_int_u16(s16, g16);

        lo32 = vaddq_u32(lo32, rnd);
        hi32 = vaddq_u32(hi32, rnd);

        lo32 = vshlq_u32(lo32, negSh);
        hi32 = vshlq_u32(hi32, negSh);

        int32x4_t loS = vqaddq_s32(vreinterpretq_s32_u32(lo32), off32);
        int32x4_t hiS = vqaddq_s32(vreinterpretq_s32_u32(hi32), off32);

        loS = vmaxq_s32(loS, zeroS);
        hiS = vmaxq_s32(hiS, zeroS);

        uint32x4_t loU = vreinterpretq_u32_s32(loS);
        uint32x4_t hiU = vreinterpretq_u32_s32(hiS);

        uint16x8_t out = vdupq_n_u16(0);
        out = vqmovnbq_u32(out, loU);
        out = vqmovntq_u32(out, hiU);

        vst1q_u16(dst + i, out);
    }

    for (; i < n; ++i) {
        uint32_t prod = (uint32_t)src[i] * (uint32_t)gain[i];
        uint32_t rounded = prod + (1u << (shift - 1));
        uint32_t shifted = rounded >> shift;
        int32_t result = (int32_t)shifted + (int32_t)offset;

        if (result < 0) result = 0;
        if (result > 65535) result = 65535;

        dst[i] = (uint16_t)result;
    }
}

void planck_lut_mve(const uint16_t *src, uint16_t *dst, int n)
{
    int i = 0;
    for (; i <= n - 8; i += 8)
    {
        uint16x8_t idx = vld1q_u16(src + i);
        uint16x8_t val = vldrhq_gather_shifted_offset_u16(planck_table, idx);
        vst1q_u16(dst + i, val);
    }
    for (; i < n; ++i) dst[i] = planck_table[src[i]];
}

/* USER CODE END 0 */

/**
  * @brief  The application entry point.
  * @retval int
  */
int main(void)
{

  /* USER CODE BEGIN 1 */
    XSPI_RegularCmdTypeDef sCommand = {0};
  /* USER CODE END 1 */

  /* Enable the CPU Cache */

  /* Enable I-Cache---------------------------------------------------------*/
  SCB_EnableICache();

  /* Enable D-Cache---------------------------------------------------------*/
  SCB_EnableDCache();

  /* MCU Configuration--------------------------------------------------------*/
  HAL_Init();

  /* USER CODE BEGIN Init */
  SCB_EnableICache();
  SCB_EnableDCache();
  MPU->CTRL = 0;
  __DSB();
  __ISB();
  /* USER CODE END Init */

  /* Configure the system clock */
  SystemClock_Config();

  /* USER CODE BEGIN SysInit */

  /* USER CODE END SysInit */

  /* Initialize all configured peripherals */
  MX_GPIO_Init();
  MX_USART1_UART_Init();
  MX_XSPI2_Init();
  /* USER CODE BEGIN 2 */
  printf("XSPI Debug startet...\r\n");
    /* USER CODE BEGIN 2 */

    /* Initialize Transmission and Reception buffer ----------------------------- */
    for (int i = 0; i < BUFFERSIZE; i++)
    {
      aTxBuffer[i] = i;
      aRxBuffer[i] = 0;
    }
  XSPI_NOR_OctalDTRModeCfg(&hxspi2);

    /* Erasing Sequence --------------------------------------------------------- */
    XSPI_WriteEnable(&hxspi2);

    sCommand.OperationType      = HAL_XSPI_OPTYPE_COMMON_CFG;
    sCommand.Instruction        = OCTAL_SECTOR_ERASE_CMD;
    sCommand.InstructionMode    = HAL_XSPI_INSTRUCTION_8_LINES;
    sCommand.InstructionWidth   = HAL_XSPI_INSTRUCTION_16_BITS;
    sCommand.InstructionDTRMode = HAL_XSPI_INSTRUCTION_DTR_ENABLE;
    sCommand.AddressMode        = HAL_XSPI_ADDRESS_8_LINES;
    sCommand.AddressWidth       = HAL_XSPI_ADDRESS_32_BITS;
    sCommand.AddressDTRMode     = HAL_XSPI_ADDRESS_DTR_ENABLE;
    sCommand.AlternateBytesMode = HAL_XSPI_ALT_BYTES_NONE;
    sCommand.DataDTRMode        = HAL_XSPI_DATA_DTR_ENABLE;
    sCommand.DataMode           = HAL_XSPI_DATA_NONE;
    sCommand.Address            = 0;
    sCommand.DummyCycles        = 0;
    sCommand.DQSMode            = HAL_XSPI_DQS_ENABLE;

    if (HAL_XSPI_Command(&hxspi2, &sCommand, HAL_XSPI_TIMEOUT_DEFAULT_VALUE) != HAL_OK)
    {
      Error_Handler();
    }

    /* Configure automatic polling mode to wait for end of erase ---------------- */
    XSPI_AutoPollingMemReady(&hxspi2);

    /* Writing Sequence --------------------------------------------------------- */
    XSPI_WriteEnable(&hxspi2);

    sCommand.Instruction = OCTAL_PAGE_PROG_CMD;
    sCommand.DataMode    = HAL_XSPI_DATA_8_LINES;
    sCommand.DataLength  = BUFFERSIZE;
    sCommand.Address     = 0;

    if (HAL_XSPI_Command(&hxspi2, &sCommand, HAL_XSPI_TIMEOUT_DEFAULT_VALUE) != HAL_OK)
    {
      Error_Handler();
    }

    if (HAL_XSPI_Transmit(&hxspi2, aTxBuffer, HAL_XSPI_TIMEOUT_DEFAULT_VALUE) != HAL_OK)
    {
      Error_Handler();
    }

    /* Configure automatic polling mode to wait for end of program -------------- */
    XSPI_AutoPollingMemReady(&hxspi2);

    /* Reading Sequence --------------------------------------------------------- */
    sCommand.Instruction        = OCTAL_IO_DTR_READ_CMD;
    sCommand.DummyCycles        = DUMMY_CLOCK_CYCLES_READ_OCTAL;
    sCommand.DataLength         = BUFFERSIZE;

    if (HAL_XSPI_Command(&hxspi2, &sCommand, HAL_XSPI_TIMEOUT_DEFAULT_VALUE) != HAL_OK)
    {
      Error_Handler();
    }

    if (HAL_XSPI_Receive(&hxspi2, (uint8_t *)aRxBuffer, HAL_XSPI_TIMEOUT_DEFAULT_VALUE) != HAL_OK)
    {
      Error_Handler();
    }

    /* Result comparison */
    for (int i = 0; i < BUFFERSIZE; i++) {
        if (aRxBuffer[i] != aTxBuffer[i]) {
            // error
        }
    }

    printf("\n[DEBUG] Basic test complete, reinitializing for performance test...\n");

    // WICHTIG: XSPI neu initialisieren!
    HAL_XSPI_DeInit(&hxspi2);
    HAL_Delay(10);
    MX_XSPI2_Init();
    HAL_Delay(10);
    XSPI_NOR_OctalDTRModeCfg(&hxspi2);

    printf("[DEBUG] XSPI reinitialized\n");
     XSPI_PerformanceTest();
    /* DeInit XSPI */
   // HAL_XSPI_DeInit(&hxspi2);

    // Nach dem Performance Test, vor der main loop
    printf("\n=== Activating Memory-Mapped Mode ===\n");

    //XSPI_RegularCmdTypeDef sCommand = {0};

    sCommand.OperationType      = HAL_XSPI_OPTYPE_READ_CFG;
    sCommand.Instruction        = OCTAL_IO_DTR_READ_CMD;
    sCommand.InstructionMode    = HAL_XSPI_INSTRUCTION_8_LINES;
    sCommand.InstructionWidth   = HAL_XSPI_INSTRUCTION_16_BITS;
    sCommand.InstructionDTRMode = HAL_XSPI_INSTRUCTION_DTR_ENABLE;
    sCommand.AddressMode        = HAL_XSPI_ADDRESS_8_LINES;
    sCommand.AddressWidth       = HAL_XSPI_ADDRESS_32_BITS;
    sCommand.AddressDTRMode     = HAL_XSPI_ADDRESS_DTR_ENABLE;
    sCommand.DataMode           = HAL_XSPI_DATA_8_LINES;
    sCommand.DataDTRMode        = HAL_XSPI_DATA_DTR_ENABLE;
    sCommand.DummyCycles        = DUMMY_CLOCK_CYCLES_READ_OCTAL;
    sCommand.DQSMode            = HAL_XSPI_DQS_ENABLE;
    sCommand.AlternateBytesMode = HAL_XSPI_ALT_BYTES_NONE;

